#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_bigquery_table.logs will be created
  + resource "google_bigquery_table" "logs" {
      + creation_time       = (known after apply)
      + dataset_id          = "broad_jade_dev_datarepo_jade_audit_10001967"
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "env" = "broad-jade-dev"
        }
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = (known after apply)
      + schema              = (known after apply)
      + self_link           = (known after apply)
      + table_id            = "all_user_requests"
      + type                = (known after apply)

      + time_partitioning {
          + type = "DAY"
        }

      + view {
          + query          = <<~EOT
                SELECT timestamp,
                  REGEXP_EXTRACT(textPayload, r"userId: ([^,]+)") AS user_id,
                  REGEXP_EXTRACT(textPayload, r"email: ([^,]+)") AS email,
                  REGEXP_EXTRACT(textPayload, r"status: ([^,]+)") AS status,
                  REGEXP_EXTRACT(textPayload, r"method: ([^,]+)") AS method,
                  REGEXP_EXTRACT(textPayload, r"url: ([^,]+)") AS url
                FROM `broad-jade-dev.broad_jade_dev_datarepo_jade_audit_10001967.stdout_*`;
            EOT
          + use_legacy_sql = false
        }
    }

  # google_bigquery_table.performance_logs will be created
  + resource "google_bigquery_table" "performance_logs" {
      + creation_time       = (known after apply)
      + dataset_id          = (known after apply)
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "env" = "broad-jade-dev"
        }
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = (known after apply)
      + schema              = (known after apply)
      + self_link           = (known after apply)
      + table_id            = "performance_logs"
      + type                = (known after apply)

      + view {
          + query          = (known after apply)
          + use_legacy_sql = false
        }
    }

  # google_project_iam_member.jade-api-sa-roles["roles/bigquery.admin"] will be created
  + resource "google_project_iam_member" "jade-api-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:jade-api-sa@broad-jade-dev.iam.gserviceaccount.com"
      + project = "broad-jade-dev"
      + role    = "roles/bigquery.admin"
    }

  # google_project_iam_member.jadeteam-roles["roles/bigquery.admin"] will be created
  + resource "google_project_iam_member" "jadeteam-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:jadeteam@broadinstitute.org"
      + project = "broad-jade-dev"
      + role    = "roles/bigquery.admin"
    }

  # module.initials-dns-set.google_dns_record_set.set_dns_record["jade-global-ms"] will be created
  + resource "google_dns_record_set" "set_dns_record" {
      + id           = (known after apply)
      + managed_zone = "datarepo-dev"
      + name         = "jade-global-ms.datarepo-dev.broadinstitute.org."
      + project      = (known after apply)
      + rrdatas      = [
          + "34.107.142.18",
        ]
      + ttl          = 300
      + type         = "A"
    }

  # module.initials-dns-set.google_dns_record_set.set_dns_record["jade-ms"] will be updated in-place
  ~ resource "google_dns_record_set" "set_dns_record" {
        id           = "datarepo-dev/jade-ms.datarepo-dev.broadinstitute.org./CNAME"
        managed_zone = "datarepo-dev"
        name         = "jade-ms.datarepo-dev.broadinstitute.org."
        project      = "broad-jade-dev"
      ~ rrdatas      = [
          - "jade-ms-global.datarepo-dev.broadinstitute.org.",
          + "jade-global-ms.datarepo-dev.broadinstitute.org.",
        ]
        ttl          = 300
        type         = "CNAME"
    }

  # module.performance-log-sinks.google_bigquery_dataset.logs[0] will be created
  + resource "google_bigquery_dataset" "logs" {
      + creation_time               = (known after apply)
      + dataset_id                  = (known after apply)
      + default_table_expiration_ms = 2678400000
      + delete_contents_on_destroy  = false
      + description                 = "Audit logs for datarepo for jade"
      + etag                        = (known after apply)
      + id                          = (known after apply)
      + labels                      = {
          + "env" = "jade"
        }
      + last_modified_time          = (known after apply)
      + location                    = "US"
      + project                     = (known after apply)
      + self_link                   = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # module.performance-log-sinks.google_logging_project_sink.bigquery-log-sink[0] will be created
  + resource "google_logging_project_sink" "bigquery-log-sink" {
      + destination            = (known after apply)
      + filter                 = "resource.type=\"k8s_container\" \"PerformanceLogger\""
      + id                     = (known after apply)
      + name                   = (known after apply)
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.performance-log-sinks.google_project_iam_binding.bigquery-admin[0] will be created
  + resource "google_project_iam_binding" "bigquery-admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.admin"
    }

  # module.performance-log-sinks.google_project_iam_binding.bigquery-data[0] will be created
  + resource "google_project_iam_binding" "bigquery-data" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.dataOwner"
    }

  # module.performance-log-sinks.google_project_iam_binding.bigquery-log-writer-permisson[0] will be created
  + resource "google_project_iam_binding" "bigquery-log-writer-permisson" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/logging.configWriter"
    }

  # module.performance-log-sinks.random_id.id will be created
  + resource "random_id" "id" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 11 to add, 1 to change, 0 to destroy.

Warning: Quoted references are deprecated

  on .terraform/modules/dns-set/terraform-modules/external-dns/dns.tf line 6, in data "google_dns_managed_zone" "dns_zone":
   6:     provider     = "google.targetdns"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

(and 3 more similar warnings elsewhere)

```

</details>

*Workflow: `Terraform GitHub Actions to validate/plan TF files`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
